src/CFD/OpenFOAM/OpenFOAM-v2206-MUI/tutorials/combustion/fireFoam/LES/simplePMMApanel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)   (1 10 10) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall coupledPatch
    (
        (0 4 7 3)
    )

    patch side
    (
        (1 2 6 5)
    )

    empty frontAndBack
    (
        (0 1 5 4)
        (7 6 2 3)
    )

    patch outlet
    (
       (4 5 6 7)
    )

    wall ground
    (
       (0 3 2 1)
    )
);

mergePatchPairs
(
);


// ************************************************************************* //
